УчетВУправляющихДляГит1/src/DataProcessors/КВП_УдалитьГенерацияПараметровДоступаДляВебПриложения/КВП_УдалитьГенерацияПараметровДоступаДляВебПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КВП_УдалитьГенерацияПараметровДоступаДляВебПриложения</name>
  <comment>Помечен на удаление в версии 3.0.30.3</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаЛС</name>
    <attributes>
      <name>ЛицевойСчет</name>
      <type>
        <types>CatalogRef.КВП_ЛицевыеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Логин</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПарольДоступа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФлагНекорректности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УчетВУправляющихДляГит1/src/Catalogs/КВП_ЛицевыеСчета/КВП_ЛицевыеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КВП_ЛицевыеСчета</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>CatalogRef.УПЖКХ_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораОПриватизации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиДокНаЖилье</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснованиеЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораОПриватизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинДоступа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЖКУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиныйЛицевойСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйСобственникПредставление</name>
    <comment>Служебный реквизит, необходим для механизма автоподбора л/с</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАдресДоставки</name>
    <comment>Помечен на удаление в 3.0.43.24</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПарольДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПечататьКвитанцииНаБумажныхНосителях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЖКУКР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиныйЛицевойСчетКР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СведенияОСобственностиПеренесены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаРегистрацииПраваСобственности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерСвидетельстваРегистрацииПраваСобственности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименованиеДокРегПраваСобственности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭлектронныйЯщик</name>
    <comment>Помечен на удалене в 3.0.64.8</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Собственик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Примечания</name>
    <comment>Примечания</comment>
    <attributes>
      <name>Подразделение</name>
      <comment>Подразделение</comment>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <comment>Ответственный</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстПримечания</name>
      <comment>Текст примечания</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/DataProcessors/КВП_УдалитьГенерацияПараметровДоступаДляВебПриложения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПечатьПамяткиДоступа(МассивОбъектов, ПараметрыПечати)
	
	// СБОР ИНФОРМАЦИИ.
	СтруктураПараметров = Новый Структура;
	ТабличныйДокумент   = Новый ТабличныйДокумент;
	
	Макет = УПЖКХ_ТиповыеМетодыСервер.ПолучитьМакет("Справочник.КВП_ЛицевыеСчета.ПФ_MXL_ПамяткаДляДоступаВЛичныйКабинетНаСайтеЖКХ");
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КВП_ЛицевыеСчета_ПамяткаДляДоступаВЛичныйКабинетНаСайтеЖКХ";
	
	Если МассивОбъектов.Количество() < 2 Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	ТипОбъекта = ТипЗнч(МассивОбъектов.Получить(1));
	
	// СБОР ИНФОРМАЦИИ.
	Организация = МассивОбъектов.Получить(0);
	СтруктураПараметров.Вставить("Организация", УПЖКХ_ПечатьКвитанцийСервер.ПолучитьНаименованиеОрганизации(Организация));
	
	// Первый элемент массива - ссылка на организацию.
	// Удаляем его.
	МассивОбъектов.Удалить(0);
	
	ТекущаяДата = УПЖКХ_ТиповыеМетодыКлиентСервер.ПолучитьРабочуюДату();
	
	ПараметрыУчетнойПолитикиТСЖотказ = Ложь;
	ПараметрыУчетнойПолитикиТСЖ = УПЖКХ_ОбщегоНазначенияСервер.ПолучитьПараметрыУчетнойПолитикиЖКХ(ТекущаяДата,
	Организация,
	ПараметрыУчетнойПолитикиТСЖотказ);
	
	Если ПараметрыУчетнойПолитикиТСЖотказ Тогда
		АдресСайта = "";
	Иначе
		АдресСайта = ПараметрыУчетнойПолитикиТСЖ.АдресСайтаКомпании;
	КонецЕсли;
	СтруктураПараметров.Вставить("АдресСайта", АдресСайта);
	
	ТаблицаВладельцевЛС = УПЖКХ_ПечатьКвитанцийСервер.ПолучитьТаблицуВладельцевЛицевыхСчетов(ТекущаяДата, МассивОбъектов);
	
	ПервыйЭлемент = Истина;
	Для Каждого ЛицевойСчет Из МассивОбъектов Цикл
		
		Если ПервыйЭлемент Тогда
			ПервыйЭлемент = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		АдресДома = Справочники.КВП_Здания.ПолучитьПредставлениеЗдания(ЛицевойСчет.Адрес.Владелец);
		Адрес     = ПолучитьАдресПомещения(АдресДома, ЛицевойСчет.Адрес);
		
		Отбор = Новый Структура;
		Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.УПЖКХ_АдресДоставкиСчетовИКвитанцийЛицевогоСчета);
		СтрокиАдреса = ЛицевойСчет.КонтактнаяИнформация.НайтиСтроки(Отбор);
		Если СтрокиАдреса.Количество() > 0 Тогда
			АдресДома = СтрокиАдреса[0].Представление;
			Адрес     = Адрес + " (адрес доставки: " + АдресДома + ")";
		КонецЕсли;
		СтруктураПараметров.Вставить("Адрес", Адрес);
		
		СтрокаВладельцаЛС = ТаблицаВладельцевЛС.Найти(ЛицевойСчет, "ЛицевойСчет");
		Если СтрокаВладельцаЛС = Неопределено Тогда
			ВладелецЛС = "";
		Иначе
			ВладелецЛС = СтрокаВладельцаЛС.Владелец;
		КонецЕсли;
		СтруктураПараметров.Вставить("ФИО", ВладелецЛС);
		
		СтруктураПараметров.Вставить("Логин",  ЛицевойСчет.Идентификатор);
		СтруктураПараметров.Вставить("Пароль", ЛицевойСчет.УдалитьПарольДоступа);
		
		// ВЫВОД ИНФОРМАЦИИ.
		Область = Макет.ПолучитьОбласть("Блок1");
		Область.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Блок2");
		Область.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Блок3");
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Блок4");
		Область.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(Область);
	КонецЦикла;
	
	ТабличныйДокумент.ПолеСнизу   = 0;
	ТабличныйДокумент.ПолеСверху  = 0;
	ТабличныйДокумент.ПолеСлева   = 0;
	ТабличныйДокумент.ПолеСправа  = 0;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, 
	КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УПЖКХ_ТиповыеМетодыСервер.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПамяткаДоступа") Тогда
	
		УПЖКХ_ТиповыеМетодыСервер.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
																   "ПамяткаДоступа",
																   "ПамяткаДоступа",
																   ПечатьПамяткиДоступа(МассивОбъектов, ПараметрыПечати));
	
	КонецЕсли;
	
КонецПроцедуры
	
#КонецЕсли
